考研相关/English-2011.org
#+TITLE: English 2011
#+OPTIONS: toc:nil
#+EXPORT_FILE_NAME: ~/Documents/org-files/org-html/English-2011.html
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/hiro/Documents/org-files/worg.css"/>

- the talk of 讨论的话题
- favorable 称赞的
- sober-side 持重的
- unpretentious 不受炫耀的
- formidable 可怕的
- conductor 指挥家
- strike 打击
- faint 虚弱的；牵强的
- composition 音乐作品
- boot up 启动
- performance 现场表演
- substitute 替代品
- troupe 演出团队
- institution 制度；习俗
- vibrant 有活力的
- markly 显著的
- orchestra 乐队
- overestimate 过高评估
- modest 谦逊的
- depart as 辞去工作
- vague 模糊的
- aspiration 渴望
- cloak 斗篷；掩盖
- broadcast 公开宣布
- board 董事会
- exeutive 高管
- scrutinize 仔细查看
- succession 继任
- turbulent 动荡的
- pick up 恢复；改善
- recruiter 招聘人员
- disgrace 丢脸；耻辱
- adhere to 坚持
- print advertisement 平面广告
- promote 促进
- approach 处理
- leverage 利用
- complementary 补足的
- user traffic 用户访问量
- dramatic 戏剧性的
- activist 激进分子
- become hostage to 成为人质
- allegation 陈词；陈述；指控
- boycott 联合抵制
- alleviate 减轻
- steep 突然的；急剧的
- engage with 与……交流
- miserable 不幸的；悲惨的
- dampen 使扫兴
- gratification 满足的
- persistent 持续不断的
- celebrate 颂扬
- procreation 生育
- provoke 煽动
- be equivalent to 等同于
- round-the-clock 日夜不断的
- dumb 愚钝的
- glamorous 迷人的；富有魅力的
