org-html/English-2011.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-19 一 22:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>English 2011</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="hiro" />
<link rel="stylesheet" type="text/css" href="/home/hiro/Documents/org-files/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">English 2011</h1>
<ul class="org-ul">
<li>the talk of 讨论的话题</li>
<li>favorable 称赞的</li>
<li>sober-side 持重的</li>
<li>unpretentious 不受炫耀的</li>
<li>formidable 可怕的</li>
<li>conductor 指挥家</li>
<li>strike 打击</li>
<li>faint 虚弱的；牵强的</li>
<li>composition 音乐作品</li>
<li>boot up 启动</li>
<li>performance 现场表演</li>
<li>substitute 替代品</li>
<li>troupe 演出团队</li>
<li>institution 制度；习俗</li>
<li>vibrant 有活力的</li>
<li>markly 显著的</li>
<li>orchestra 乐队</li>
<li>overestimate 过高评估</li>
<li>modest 谦逊的</li>
<li>depart as 辞去工作</li>
<li>vague 模糊的</li>
<li>aspiration 渴望</li>
<li>cloak 斗篷；掩盖</li>
<li>broadcast 公开宣布</li>
<li>board 董事会</li>
<li>exeutive 高管</li>
<li>scrutinize 仔细查看</li>
<li>succession 继任</li>
<li>turbulent 动荡的</li>
<li>pick up 恢复；改善</li>
<li>recruiter 招聘人员</li>
<li>disgrace 丢脸；耻辱</li>
<li>adhere to 坚持</li>
<li>print advertisement 平面广告</li>
<li>promote 促进</li>
<li>approach 处理</li>
<li>leverage 利用</li>
<li>complementary 补足的</li>
<li>user traffic 用户访问量</li>
<li>dramatic 戏剧性的</li>
<li>activist 激进分子</li>
<li>become hostage to 成为人质</li>
<li>allegation 陈词；陈述；指控</li>
<li>boycott 联合抵制</li>
<li>alleviate 减轻</li>
<li>steep 突然的；急剧的</li>
<li>engage with 与……交流</li>
<li>miserable 不幸的；悲惨的</li>
<li>dampen 使扫兴</li>
<li>gratification 满足的</li>
<li>persistent 持续不断的</li>
<li>celebrate 颂扬</li>
<li>procreation 生育</li>
<li>provoke 煽动</li>
<li>be equivalent to 等同于</li>
<li>round-the-clock 日夜不断的</li>
<li>dumb 愚钝的</li>
<li>glamorous 迷人的；富有魅力的</li>
</ul>
</div>
<div id="postamble" class="status">
<p class="author">Author: hiro</p>
<p class="date">Created: 2018-11-19 一 22:46</p>
<p class="validation"></p>
</div>
</body>
</html>
